{
    "plugins": [
        {
            "footer": "##Attributes \n\n  * `href` - the URL to send. \n  * `font` - the font to display in the button. Options: 'arial', 'lucida grande', 'segoe ui', 'tahoma', 'trebuchet ms', 'verdana' \n  * `colorscheme` - the color scheme for the button. Options: 'light', 'dark' \n  * `ref` - a label for tracking referrals; must be less than 50 characters and can contain alphanumeric characters and some punctuation (currently +/=-.:_). The ref attribute causes two parameters to be added to the referrer URL when a user clicks a link from a stream story about a Send action: \n * `fb_ref` - the ref parameter \n * `fb_source` - the story type ('message', 'group', 'email') in which the click occurred.\n\n##FAQ\n\n###How do I know when someone sends a message from the plugin?\nIf you use the XFBML version you can subscribe to the 'message.send' event through [FB.Event.subscribe](http://developers.facebook.com/docs/reference/javascript/FB.Event.subscribe/).\n\n###How do I display the Send button in different languages?\n\nInclude the language code when you instantiate the library. Replace ‘en_US’ in this line with the correct locale code:\n\n    '//connect.facebook.net/en_US/all.js';\n\n###What analytics are available about the Send button?\n\nIf you visit [facebook.com/insights](http://www.facebook.com/insights) and register your domain, you can see the number of sends from your domain each day and the demographics of who is clicking the Send button.\n\n###What is the best way to know which Send button on my page generated the traffic?\n\nAdd the 'ref' parameter to the plugin (see \"Attributes\" above).\n\n Examples:\n\n    <fb:send ref=\"top_left\"></fb:send>\n    <iframe src=\"...&ref=top_left\"></iframe>\n\nWhen a user clicks a link back to your website, we will pass the ref value as a fb_ref parameter in the referrer URL. Example:\n\n    http://www.yoursite.com/home?fb_ref=top_left&fb_source=message\n\nAggregated stream stories contain all ref parameters, concatenated with commas.\n\n###When I click the Send button, the popup window (or \"flyout\") doesn't show. Why?\n\nIf the Send button is placed near the edge of an HTML element with the `overflow` property set to `hidden`, the flyout may be clipped or completely hidden when the button is clicked.  This can be remedied by setting setting the `overflow` property to a value other than `hidden`, such as `visible`, `scroll`, or `auto`.", 
            "name": "Send Button", 
            "params": {
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 5, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "font": {
                    "description": "The font of the plugin", 
                    "label": "Font", 
                    "priority": 5, 
                    "type": "enum", 
                    "values": [
                        null, 
                        "arial", 
                        "lucida grande", 
                        "segoe ui", 
                        "tahoma", 
                        "trebuchet ms", 
                        "verdana"
                    ]
                }, 
                "href": {
                    "description": "The URL to send.", 
                    "example": "http://example.com", 
                    "label": "URL to Send", 
                    "priority": 1, 
                    "type": "string"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/send/", 
            "xfbml": "fb:send"
        }, 
        {
            "creates_appid": true, 
            "footer": "##Attributes \n\n  * `href` - profile URL of the user to subscribe to. This must be a facebook.com profile URL.  \n  * `layout` - there are three options. \n    * `standard` - displays social text to the right of the button and friends' profile photos below. Minimum width: 225 pixels. Default width: 450 pixels. Height: 35 pixels (without photos) or 80 pixels (with photos). \n    * `button_count` - displays the total number of subscribers to the right of the button. Minimum width: 90 pixels.  Default width: 90 pixels. Height: 20 pixels. \n    * `box_count` - displays the total number of subscribers above the button. Minimum width: 55 pixels.  Default width: 55 pixels. Height: 65 pixels.\n  * `show_faces` - specifies whether to display profile photos below the button (standard layout only) \n  * `colorscheme` - the color scheme for the plugin. Options: 'light' (default) and 'dark' \n  * `font` - the font to display in the plugin. Options: 'arial', 'lucida grande', 'segoe ui', 'tahoma', 'trebuchet ms', 'verdana' \n  * `width` - the width of the plugin. \n", 
            "iframe": "http://www.facebook.com/plugins/subscribe.php", 
            "name": "Subscribe Button", 
            "params": {
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 4, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "font": {
                    "description": "the font of the plugin", 
                    "label": "Font", 
                    "priority": 5, 
                    "type": "enum", 
                    "values": [
                        null, 
                        "arial", 
                        "lucida grande", 
                        "segoe ui", 
                        "tahoma", 
                        "trebuchet ms", 
                        "verdana"
                    ]
                }, 
                "href": {
                    "description": "Profile URL of the user to subscribe to.", 
                    "example": "https://www.facebook.com/zuck", 
                    "label": "Profile URL", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "layout": {
                    "default": "standard", 
                    "description": "determines the size and amount of social context next to the button", 
                    "label": "Layout Style", 
                    "priority": 2, 
                    "type": "enum", 
                    "values": [
                        "standard", 
                        "button_count", 
                        "box_count"
                    ]
                }, 
                "show_faces": {
                    "default": true, 
                    "description": "Show profile pictures below the button. Applicable to Standard layout only.", 
                    "label": "Show Faces", 
                    "priority": 3, 
                    "type": "bool", 
                    "valueLabel": "Show faces"
                }, 
                "width": {
                    "default": 450, 
                    "description": "the width of the plugin, in pixels", 
                    "label": "Width", 
                    "priority": 6, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/subscribe/", 
            "xfbml": "fb:subscribe"
        }, 
        {
            "footer": "##Attributes \n\n  * `href` - the URL for this Comments plugin. News feed stories on Facebook will link to this URL. \n  * `width` - the width of the plugin in pixels. Minimum recommended width: 400px. \n  * `colorscheme` - the color scheme for the plugin. Options: 'light', 'dark' \n  * `num_posts` - the number of comments to show by default. Default: 10. Minimum: 1 \n  * `mobile` - whether to show the mobile-optimized version. Default: auto-detect. \n \n##Moderation tools \n\nAdmins can choose to make the default for new comments entered either “visible to everyone” or “has limited visibility” on the site (i.e., the comment is only visible to the commenter and their friends), to help mitigate irrelevant content.\n\nAdmins can also blacklist words and ban users. If a new comment is published from a banned user or contains a blacklisted word, this comment will automatically have limited visibility.\n\nTo moderate, you need to list yourself as an admin. To do this, simply include open graph meta tags on the URL specified as the href parameter of the plugin. These tags must be included in the &lt;head&gt; of the document. Include:\n\n    <meta property=\"fb:admins\" content=\"{YOUR_FACEBOOK_USER_ID}\"/>\n\nTo add multiple moderators, separate the uids by comma without spaces.\n\nIf your site has many comments boxes, we strongly recommend you specify a Facebook app id as the administrator (all administrators of the app will be able to moderate comments). Doing this enables a moderator interface on Facebook where comments from all plugins administered by your app id can be easily moderated together. This tag should be specified in the &lt;head&gt;.\n\n    <meta property=\"fb:app_id\" content=\"{YOUR_APPLICATION_ID}\"/>\n\nYou can moderate comments from just this plugin inline. If you have specified your app id as the admin, you can moderate all your plugins at [http://developers.facebook.com/tools/comments](http://developers.facebook.com/tools/comments). \n\nWhen you implement multiple comments boxes on your site and tie them together using an app_id, the moderation settings you choose will apply to all your comments boxes. For example, changing the moderation setting to 'has limited visibility' will affect all comments boxes under the same app_id. If you need to apply different moderation paradigms in different areas of your site, you should use two or more app_ids. You may then apply different moderation settings each group of comments boxes.\n\n##FAQ\n\n###How do I access the number of comments left of my page?\n The `fb:comments-count` tag will emit the number of comments on your URL in a `<span>` tag. You can then style this however appropriate to match your site. Note this is currently not available in HTML5. For example, to show the number of comments on example.com:.\n\n    <fb:comments-count href=http://example.com/></fb:comments-count> awesome comments \n Will emit: \n\n <fb:comments-count href=http://example.com/ ></fb:comments-count> awesome comments \n\n You can also load an iframe from Facebook which will display the number of comments with a link to your URL. \n For example, this shows the number of comments for example.com.\n\n    <iframe src=\"http://www.facebook.com/plugins/comments.php?href=example.com&permalink=1\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:130px; height:16px;\" allowTransparency=\"true\"></iframe> \n <iframe src=\"http://www.facebook.com/plugins/comments.php?href=example.com&permalink=1\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:130px; height:16px;\" allowTransparency=\"true\"></iframe>  \n\n\n\n The number of comments left on a particular URL can be accessed via the Graph API. For example, the number of comments on example.com is the 'comments' field of: [https://graph.facebook.com/?ids=http://example.com/](https://graph.facebook.com/?ids=http://example.com/). \n\n You can also use the [comment FQL table](http://developers.facebook.com/docs/reference/fql/comment/). \n\n###How do I know when someone comments on my site?\nYou can subscribe to the 'comment.create' and 'comment.remove' events through [FB.Event.subscribe](http://developers.facebook.com/docs/reference/javascript/FB.Event.subscribe/).\n\n###What does the grammar filter do? \n  * Adds punctuation (e.g. periods at the end of sentences) \n  * Trims extra whitespace \n  * Expands slang words (e.g. plz becomes please) \n  * Adds a space after punctuation (e.g. Hi,Cat would become Hi, Cat) \n  * Fix common grammar mistakes (e.g. convert ‘dont' to ‘don’t’)\n\n You can enable the grammar filter from the settings section of the plugin. \n\n###How do I access the comments left on my site? \n The comments for every URL can be accessed via the graph API. Simply go to: [https://graph.facebook.com/comments/?ids={YOUR_URL}](https://graph.facebook.com/comments/?ids={YOUR_URL}). \n\nFor example, the comments on this URL can be accessed via: [https://graph.facebook.com/comments/?ids=http://developers.facebook.com/docs/reference/plugins/comments](https://graph.facebook.com/comments/?ids=http://developers.facebook.com/docs/reference/plugins/comments). \n\nSample code for pulling comments can be found on this [blog post](http://developers.facebook.com/blog/post/490).\n\n###How can I get an SEO boost from the comments left on my site? \n The Facebook comments box is rendered in an iframe on your page, and most search engines will not crawl content within an iframe. However, you can access all the comments left on your site via the graph API as described above. Simply grab the comments from the API and render them in the body of your page behind the comments box. We recommend you cache the results, as pulling the comments from the graph API on each page load could slow down the rendering time of the page.\n\n###How do I enable users to comment using other login providers?\n On the settings section of the plugin, you can choose to enable third party login on your comments boxes. Currently this will enable users to comment using a Yahoo!, AOL or Hotmail account. \n\n###How does the blacklisting words work?\n You can enter blacklisted terms from the settings section of the comments box. The content of new comments is checked against the blacklist of terms to see if this comment should have limited visibility. The comment is checked via substring matching. This means if you blacklist the word 'at', if the comment contains the sequence 'a' 't' anywhere it will be marked with limited visibility; e.g. if the comment contained the words 'bat', 'hat', 'attend', etc it would be caught.\n\n###I have the first version of the Facebook Comments box, how do I upgrade?\n If you are using the original version of the Facebook Comments box, just add 'migrated=1' to the `<fb:comments>` tag, and the comments box will automatically switch to the new version. In this case, you should not specify the `href` parameter, and you must keep the XID parameter the same. Once you migrate, you can access the comments as described above. Note that the moderation tools only work with the newer version of the comments plugin (with href specified instead of migrated=1).", 
            "name": "Comments", 
            "nofloat": true, 
            "params": {
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 5, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "href": {
                    "description": "The URL for this comments box", 
                    "example": "http://example.com", 
                    "label": "URL to comment on", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "num_posts": {
                    "default": 10, 
                    "description": "the number of posts to display by default.", 
                    "example": 2, 
                    "label": "Number of posts", 
                    "priority": 3, 
                    "type": "int"
                }, 
                "width": {
                    "default": 550, 
                    "description": "the width of the plugin, in pixels", 
                    "example": 470, 
                    "label": "Width", 
                    "priority": 3, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/comments/", 
            "xfbml": "fb:comments"
        }, 
        {
            "footer": "##Attributes \n\n  * `site` - the domain for which to show activity; include just the full domain name, without `http://` or a path. The XFBML version defaults to the current domain. \n  * `action` - a comma separated list of actions to show activities for. \n  * `app_id` - will display all actions, custom and global, associated with this app_id. \n  * `width` - the width of the plugin in pixels. Default width: 300px. \n  * `height` - the height of the plugin in pixels. Default height: 300px. \n  * `header` - specifies whether to show the Facebook header. \n  * `colorscheme` - the color scheme for the plugin. Options: 'light', 'dark' \n  * `font` - the font to display in the plugin. Options: 'arial', 'lucida grande', 'segoe ui', 'tahoma', 'trebuchet ms', 'verdana' \n  * `border_color` - the border color of the plugin. \n  * `recommendations` - specifies whether to always show recommendations in the plugin. If `recommendations` is set to `true`, the plugin will display recommendations in the bottom half.  \n  * `filter` - allows you to filter which URLs are shown in the plugin. The plugin will only include URLs which contain the filter string in the first two path parameters of the URL. If nothing in the first two path parameters of the URL matches the filter, the URL will not be included. For example, if the 'site' parameter is set to 'www.example.com' and the 'filter' parameter was set to '/section1/section2' then only pages which matched 'http://www.example.com/section1/section2/*' would be included in the activity feed section of this plugin. The filter parameter does not apply to any recommendations which may appear in this plugin (see above); Recommendations are based only on 'site' parameter.\n  * `linktarget` - This specifies the context in which content links are opened. By default all links within the plugin will open a new window. If you want the content links to open in the same window, you can set this parameter to `_top` or `_parent`. Links to Facebook URLs will always open in a new window. \n  * `ref` - a label for tracking referrals; must be less than 50 characters and can contain alphanumeric characters and some punctuation (currently +/=-.:_). Specifying a value for the ref attribute adds the 'fb_ref' parameter to the any links back to your site which are clicked from within the plugin. Using different values for the ref parameter for different positions and configurations of this plugin within your pages allows you to track which instances are performing the best.  \n  * `max_age` - a limit on recommendation and creation time of articles that are surfaced in the plugins, the default is 0 (we don’t take age into account). Otherwise the valid values are 1-180, which specifies the number of days.  \n\n##What is the best way to know which plugin on my site generated the traffic?\n\nAdd the 'ref' parameter to the plugin (see \"Attributes\" above).\n\n Examples:\n\n    <fb:activity ref=\"homepage\"></fb:activity>\n    <iframe src=\"...&ref=homepage\"></iframe>\n\nWhen a user clicks a link on the plugin, we will pass back the ref value as a fb_ref parameter in the referrer URL. Example:\n\n    http://www.facebook.com/l.php?fb_ref=homepage", 
            "iframe": "http://www.facebook.com/plugins/activity.php", 
            "include_fb_root": false, 
            "name": "Activity Feed", 
            "params": {
                "action": {
                    "description": "Comma separated list of action of action types", 
                    "label": "Action", 
                    "priority": 3, 
                    "type": "string"
                }, 
                "app_id": {
                    "description": "Associated App ID", 
                    "label": "App ID", 
                    "priority": 2, 
                    "type": "int"
                }, 
                "border_color": {
                    "description": "The border color of the plugin.", 
                    "label": "Border Color", 
                    "priority": 9, 
                    "type": "color"
                }, 
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 7, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "font": {
                    "description": "The font of the plugin.", 
                    "label": "Font", 
                    "priority": 10, 
                    "type": "enum", 
                    "values": [
                        null, 
                        "arial", 
                        "lucida grande", 
                        "segoe ui", 
                        "tahoma", 
                        "trebuchet ms", 
                        "verdana"
                    ]
                }, 
                "header": {
                    "default": true, 
                    "description": "Show the Facebook header on the plugin.", 
                    "label": "Header", 
                    "priority": 6, 
                    "type": "bool", 
                    "valueLabel": "Show header"
                }, 
                "height": {
                    "default": 300, 
                    "description": "The height of the plugin in pixels.", 
                    "label": "Height", 
                    "priority": 5, 
                    "type": "int"
                }, 
                "linktarget": {
                    "default": "_blank", 
                    "description": "The context in which content links are opened", 
                    "label": "Link Target", 
                    "priority": 8, 
                    "type": "enum", 
                    "values": [
                        "_blank", 
                        "_top", 
                        "_parent"
                    ]
                }, 
                "recommendations": {
                    "default": false, 
                    "description": "Show recommendations", 
                    "label": "Recommendations", 
                    "priority": 11, 
                    "type": "bool", 
                    "valueLabel": "Show recommendations"
                }, 
                "site": {
                    "description": "The domain to show activity for e.g. 'www.example.com'. In XFBML, defaults to the domain the plugin is on.", 
                    "iframe_example": "www.example.com", 
                    "label": "Domain", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "width": {
                    "default": 300, 
                    "description": "The width of the plugin in pixels.", 
                    "label": "Width", 
                    "priority": 4, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/activity/", 
            "xfbml": "fb:activity"
        }, 
        {
            "footer": "##Attributes \n\n  * `site` - the domain to show recommendations for. The XFBML version defaults to the current domain. \n  * `action` - a comma separated list of actions to show recommendations for. \n  * `app_id` - will display recommendations for all types of actions, custom and global, associated with this app_id. \n  * `width` - the width of the plugin in pixels. Default width: 300px. \n  * `height` - the height of the plugin in pixels. Default height: 300px. \n  * `header` - specifies whether to show the Facebook header. \n  * `colorscheme` - the color scheme for the plugin. Options: 'light', 'dark' \n  * `font` - the font to display in the plugin. Options: 'arial', 'lucida grande', 'segoe ui', 'tahoma', 'trebuchet ms', 'verdana' \n  * `border_color` - the border color of the plugin. \n  * `linktarget` - This specifies the context in which content links are opened. By default all links within the plugin will open a new window. If you want the content links to open in the same window, you can set this parameter to `_top` or `_parent`. Links to Facebook URLs will always open in a new window. \n  * `ref` - a label for tracking referrals; must be less than 50 characters and can contain alphanumeric characters and some punctuation (currently +/=-.:_). Specifying a value for the ref attribute adds the 'fb_ref' parameter to the any links back to your site which are clicked from within the plugin. Using different values for the ref parameter for different positions and configurations of this plugin within your pages allows you to track which instances are performing the best.  \n  *  `max_age` - a limit on recommendation and creation time of articles that are surfaced in the plugins, the default is 0 (we don’t take age into account). Otherwise the valid values are 1-180, which specifies the number of days. \n\n##What is the best way to know which plugin on my site generated the traffic?\n\nAdd the 'ref' parameter to the plugin (see \"Attributes\" above).\n\n Examples:\n\n    <fb:recommendations ref=\"homepage\"></fb:recommendations>\n    <iframe src=\"...&ref=homepage\"></iframe>\n\nWhen a user clicks a link on the plugin, we will pass back the ref value as a fb_ref parameter in the referrer URL. Example:\n\n    http://www.facebook.com/l.php?fb_ref=homepage", 
            "iframe": "http://www.facebook.com/plugins/recommendations.php", 
            "include_fb_root": false, 
            "name": "Recommendations Box", 
            "params": {
                "action": {
                    "description": "Comma separated list of action of action types", 
                    "label": "Action", 
                    "priority": 3, 
                    "type": "string"
                }, 
                "app_id": {
                    "description": "Associated App ID", 
                    "label": "App ID", 
                    "priority": 2, 
                    "type": "int"
                }, 
                "border_color": {
                    "description": "The border color of the plugin.", 
                    "label": "Border Color", 
                    "priority": 9, 
                    "type": "color"
                }, 
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 7, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "font": {
                    "description": "The font of the plugin.", 
                    "label": "Font", 
                    "priority": 10, 
                    "type": "enum", 
                    "values": [
                        null, 
                        "arial", 
                        "lucida grande", 
                        "segoe ui", 
                        "tahoma", 
                        "trebuchet ms", 
                        "verdana"
                    ]
                }, 
                "header": {
                    "default": true, 
                    "description": "Show the Facebook header on the plugin.", 
                    "label": "Header", 
                    "priority": 6, 
                    "type": "bool", 
                    "valueLabel": "Show header"
                }, 
                "height": {
                    "default": 300, 
                    "description": "The height of the plugin in pixels.", 
                    "label": "Height", 
                    "priority": 5, 
                    "type": "int"
                }, 
                "linktarget": {
                    "default": "_blank", 
                    "description": "The context in which content links are opened", 
                    "label": "Link Target", 
                    "priority": 8, 
                    "type": "enum", 
                    "values": [
                        "_blank", 
                        "_top", 
                        "_parent"
                    ]
                }, 
                "site": {
                    "description": "The domain for which to show recommendations. Defaults to the domain the plugin is on.", 
                    "label": "Domain", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "width": {
                    "default": 300, 
                    "description": "The width of the plugin in pixels.", 
                    "label": "Width", 
                    "priority": 4, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/recommendations/", 
            "xfbml": "fb:recommendations"
        }, 
        {
            "footer": "##Attributes \n\n  * `href` - the URL of the Facebook Page for this Like Box \n  * `width` - the width of the plugin in pixels. Default width: 300px. \n  * `height` - the height of the plugin in pixels. The default height varies based on number of faces to display, and whether the stream is displayed. With the stream displayed, and 10 faces the default height is 556px. With no faces, and no stream the default height is 63px. \n  * `colorscheme` - the color scheme for the plugin. Options: 'light', 'dark' \n  * `show_faces` - specifies whether or not to display profile photos in the plugin. Default value: true. \n  * `stream` - specifies whether to display a stream of the latest posts from the Page's wall \n  * `header` - specifies whether to display the Facebook header at the top of the plugin. \n  * `border_color` - the border color of the plugin. \n  * `force_wall` - for Places, specifies whether the stream contains posts from the Place's wall or just checkins from friends. Default value: false.\n##How do I know when a user clicks a Like button? \n\n If you are using the XFBML version of the button, you can subscribe to the 'edge.create' event through [FB.Event.subscribe](/docs/reference/javascript/FB.Event.subscribe).\n\n", 
            "iframe": "http://www.facebook.com/plugins/likebox.php", 
            "name": "Like Box", 
            "params": {
                "border_color": {
                    "description": "The border color of the plugin.", 
                    "label": "Border Color", 
                    "priority": 6, 
                    "type": "color"
                }, 
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin. Note that the background is always transparent to match your background color. This setting changes the foreground colors to work well on light or dark backgrounds.", 
                    "label": "Color Scheme", 
                    "priority": 5, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "header": {
                    "default": true, 
                    "description": "Show the 'Find us on Facebook' bar at top. Only shown when either stream or faces are present.", 
                    "label": "Header", 
                    "priority": 7, 
                    "type": "bool", 
                    "valueLabel": "Show header"
                }, 
                "height": {
                    "default": "", 
                    "description": "The height of the plugin in pixels (optional).", 
                    "label": "Height", 
                    "priority": 3, 
                    "type": "int"
                }, 
                "href": {
                    "default": "http://www.facebook.com/platform", 
                    "description": "The URL of the Facebook Page for this Like box.", 
                    "example": "http://www.facebook.com/platform", 
                    "label": "Facebook Page URL", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "show_faces": {
                    "default": true, 
                    "description": "Show profile photos in the plugin.", 
                    "label": "Show Faces", 
                    "priority": 5, 
                    "type": "bool"
                }, 
                "stream": {
                    "default": true, 
                    "description": "Show the profile stream for the public profile.", 
                    "label": "Stream", 
                    "priority": 6, 
                    "type": "bool", 
                    "valueLabel": "Show stream"
                }, 
                "width": {
                    "default": 292, 
                    "description": "The width of the plugin in pixels.", 
                    "label": "Width", 
                    "priority": 2, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/like-box/", 
            "xfbml": "fb:like-box"
        }, 
        {
            "footer": "##Attributes \n\n  * `show-faces` - specifies whether to show faces underneath the Login button. \n  * `width` - the width of the plugin in pixels. Default width: 200px. \n  * `max-rows` - the maximum number of rows of profile pictures to display. Default value: 1. \n  * `scope` - a comma separated list of extended permissions. By default the Login button prompts users for their public information. If your application needs to access other parts of the user's profile that may be private, your application can request extended permissions. A complete list of extended permissions can be found [here](/docs/authentication/permissions/).\n  * `registration-url` - registration page url. If the user has not registered for your site, they will be redirected to the URL you specify in the registration-url parameter.\n", 
            "name": "Login Button", 
            "params": {
                "max-rows": {
                    "default": 1, 
                    "description": "The maximum number of rows of profile pictures to show.", 
                    "label": "Max Rows", 
                    "priority": 3, 
                    "type": "int"
                }, 
                "show-faces": {
                    "default": false, 
                    "description": "Show pictures of the user's friends who have joined your site", 
                    "example": true, 
                    "label": "Show Faces", 
                    "priority": 1, 
                    "type": "bool"
                }, 
                "width": {
                    "default": 200, 
                    "description": "The width of the plugin in pixels", 
                    "label": "Width", 
                    "priority": 2, 
                    "type": "int"
                }
            }, 
            "requires_appid": true, 
            "url": "https://developers.facebook.com/docs/reference/plugins/login/", 
            "xfbml": "fb:login-button"
        }, 
        {
            "footer": "##Attributes \n\n  * `href` - the URL of the page. The plugin will display photos of users who have liked this page. \n  * `action` - an action type. The plugin will display photos of users who have connected to your app via this action. \n  * `app_id` - if you want the plugin to display users who have connected to your site, specify your application id as this parameter. This parameter is only available in the iframe version of the Facepile. If you are using the XFBML version of the plugin, specify your application id when you initialize the Javascript library. \n  * `max_rows` - the maximum number of rows of faces to display. The XFBML version will dynamically size its height; if you specify a maximum of four rows of faces, but there are only enough friends to fill two rows, the XFBML version of the plugin will set its height for two rows of faces. Default: 1. \n  * `width` - width of the plugin in pixels. Default width: 300px. \n  * `size` - size of the photos and social context. Default size: medium.  \n  * `colorscheme` - the color scheme for the like button. Options: 'light', 'dark'.\n\n##Why is nothing displaying? \n\n The plugin only displays friends photos. If the user does not have friends who have liked your page or have connected to your site, no faces will be shown. \n\n If you are displaying users who have liked your page, and no users have liked it yet, the plugin will render nothing. If some users have liked your page, but none of the viewing users friends have liked it, the plugin will display the total number of users who have liked your page. \n\nIf you are displaying users who have connected to your site, and none of the users friends have connected yet, the plugin will render nothing.\n\n##How to show users who have connected to your site \n\n You need to specify your application id. If you are using the iframe version simply include it as another query parameter. Example: \n\n    <iframe src=\"http://www.facebook.com/plugins/facepile.php? \n    app_id={YOUR_APP_ID}\" scrolling=\"no\" frameborder=\"0\" style=\"border:none;  \n    overflow:hidden; width:200px;\" allowTransparency=\"true\"></iframe> \n\n If you are using the XFBML version specify your application id when you initialize the Javascript library. Example: \n\n    <div id=\"fb-root\"></div><script src=\"http://connect.facebook.net/en_US/all.js\n    #appId={YOUR_APP_ID}&amp;xfbml=1\"></script><fb:facepile></fb:facepile>", 
            "iframe": "http://www.facebook.com/plugins/facepile.php", 
            "name": "Facepile", 
            "params": {
                "action": {
                    "description": "Comma separated list of action of action types", 
                    "label": "Action", 
                    "priority": 2, 
                    "type": "string"
                }, 
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 6, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "href": {
                    "default": "", 
                    "description": "If you want the Facepile to display friends who have liked your page, specify the URL of the page here.", 
                    "example": "http://developers.facebook.com", 
                    "label": "URL", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "max_rows": {
                    "default": 1, 
                    "description": "The maximum number of rows of profile pictures to show.", 
                    "label": "Num rows", 
                    "priority": 4, 
                    "type": "int"
                }, 
                "size": {
                    "default": "medium", 
                    "description": "Determines the size of the images and social context in the facepile.", 
                    "label": "Size", 
                    "priority": 3, 
                    "type": "enum", 
                    "values": [
                        "small", 
                        "medium", 
                        "large"
                    ]
                }, 
                "width": {
                    "default": 300, 
                    "description": "The width of the plugin in pixels.", 
                    "label": "Width", 
                    "priority": 5, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/facepile/", 
            "xfbml": "fb:facepile"
        }, 
        {
            "creates_appid": false, 
            "iframe": "http://www.facebook.com/plugins/question.php", 
            "include_fb_root": true, 
            "name": "Question", 
            "nofloat": false, 
            "params": {
                "id": {
                    "priority": "999", 
                    "type": "hidden"
                }, 
                "options": {
                    "default_poll0": "Yellow", 
                    "default_poll1": "Green", 
                    "default_poll2": "Red", 
                    "default_poll3": "Blue", 
                    "description": "The different poll options to choose from", 
                    "label": "Answer Options", 
                    "not_in_getcode": "true", 
                    "priority": 2, 
                    "type": "question"
                }, 
                "pageselector": {
                    "description": "Who the question will be asked as", 
                    "label": "Ask Question As", 
                    "not_in_getcode": "true", 
                    "priority": 3, 
                    "type": "pageselector"
                }, 
                "questiontext": {
                    "always_set": "true", 
                    "default": "Which of the following is the best color?", 
                    "description": "The text of the question to ask", 
                    "label": "Question", 
                    "not_in_getcode": "true", 
                    "priority": 1, 
                    "type": "multilinestring"
                }, 
                "width": {
                    "default": "400", 
                    "description": "The width of the plugin when rendered on the screen", 
                    "label": "Width", 
                    "priority": 4, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "requires_loggedin": true, 
            "url": "https://developers.facebook.com/docs/reference/plugins/question/", 
            "xfbml": "fb:question"
        }, 
        {
            "footer": "##Attributes \n\n  * `site` - the domain to show recommendations for. The XFBML version defaults to the current domain. \n  * `action` - a comma separated list of actions to show recommendations for. \n  * `app_id` - will display recommendations for all types of actions, custom and global, associated with this app_id. \n  * `width` - the width of the plugin in pixels. Default width: 300px. \n  * `height` - the height of the plugin in pixels. Default height: 300px. \n  * `header` - specifies whether to show the Facebook header. \n  * `colorscheme` - the color scheme for the plugin. Options: 'light', 'dark' \n  * `font` - the font to display in the plugin. Options: 'arial', 'lucida grande', 'segoe ui', 'tahoma', 'trebuchet ms', 'verdana' \n  * `border_color` - the border color of the plugin. \n  * `linktarget` - This specifies the context in which content links are opened. By default all links within the plugin will open a new window. If you want the content links to open in the same window, you can set this parameter to `_top` or `_parent`. Links to Facebook URLs will always open in a new window. \n  * `ref` - a label for tracking referrals; must be less than 50 characters and can contain alphanumeric characters and some punctuation (currently +/=-.:_). Specifying a value for the ref attribute adds the 'fb_ref' parameter to the any links back to your site which are clicked from within the plugin. Using different values for the ref parameter for different positions and configurations of this plugin within your pages allows you to track which instances are performing the best.  \n  *  `max_age` - a limit on recommendation and creation time of articles that are surfaced in the plugins, the default is 0 (we don’t take age into account). Otherwise the valid values are 1-180, which specifies the number of days. \n\n##What is the best way to know which plugin on my site generated the traffic?\n\nAdd the 'ref' parameter to the plugin (see \"Attributes\" above).\n\n Examples:\n\n    <fb:recommendations ref=\"homepage\"></fb:recommendations>\n    <iframe src=\"...&ref=homepage\"></iframe>\n\nWhen a user clicks a link on the plugin, we will pass back the ref value as a fb_ref parameter in the referrer URL. Example:\n\n    http://www.facebook.com/l.php?fb_ref=homepage", 
            "iframe": "http://www.facebook.com/plugins/recommendations.php", 
            "include_fb_root": false, 
            "name": "Recommendations Box", 
            "params": {
                "action": {
                    "description": "Comma separated list of action of action types", 
                    "label": "Action", 
                    "priority": 3, 
                    "type": "string"
                }, 
                "app_id": {
                    "description": "Associated App ID", 
                    "label": "App ID", 
                    "priority": 2, 
                    "type": "int"
                }, 
                "border_color": {
                    "description": "The border color of the plugin.", 
                    "label": "Border Color", 
                    "priority": 9, 
                    "type": "color"
                }, 
                "colorscheme": {
                    "default": "light", 
                    "description": "The color scheme of the plugin.", 
                    "label": "Color Scheme", 
                    "priority": 7, 
                    "type": "enum", 
                    "values": [
                        "light", 
                        "dark"
                    ]
                }, 
                "font": {
                    "description": "The font of the plugin.", 
                    "label": "Font", 
                    "priority": 10, 
                    "type": "enum", 
                    "values": [
                        null, 
                        "arial", 
                        "lucida grande", 
                        "segoe ui", 
                        "tahoma", 
                        "trebuchet ms", 
                        "verdana"
                    ]
                }, 
                "header": {
                    "default": true, 
                    "description": "Show the Facebook header on the plugin.", 
                    "label": "Header", 
                    "priority": 6, 
                    "type": "bool", 
                    "valueLabel": "Show header"
                }, 
                "height": {
                    "default": 300, 
                    "description": "The height of the plugin in pixels.", 
                    "label": "Height", 
                    "priority": 5, 
                    "type": "int"
                }, 
                "linktarget": {
                    "default": "_blank", 
                    "description": "The context in which content links are opened", 
                    "label": "Link Target", 
                    "priority": 8, 
                    "type": "enum", 
                    "values": [
                        "_blank", 
                        "_top", 
                        "_parent"
                    ]
                }, 
                "site": {
                    "description": "The domain for which to show recommendations. Defaults to the domain the plugin is on.", 
                    "label": "Domain", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "width": {
                    "default": 300, 
                    "description": "The width of the plugin in pixels.", 
                    "label": "Width", 
                    "priority": 4, 
                    "type": "int"
                }
            }, 
            "requires_appid": false, 
            "url": "https://developers.facebook.com/docs/reference/plugins/recommendations2/", 
            "xfbml": "fb:recommendations"
        }, 
        {
            "creates_appid": true, 
            "footer": "##Attributes \n\n  * `href` - the URL of the page. The XFBML version defaults to the current page. \n  * `trigger` - when the plugin expands. Note that this parameter is evaluated in addition to the `read_time` parameter. Default is when a user scrolls past the <fb:recommendations-bar/> tag. There are three options. \n    * `onvisible` - read is published when a user scrolls past the exact point where the XFBML tag is placed on the page.\n    * `X%` - where X is any positive integer less than or equal to 100. Indicates % of page scrolled past before read is triggered \n    * `manual` - use this option to manually trigger the read action. You call `FB.XFBML.RecommendationsBar.markRead(href);` when you want the plugin to expand. The `href` parameter is only necessary if the <fb:recommendations-bar/> tag includes an explicit `href` attribute.  By default, this is the current request URL. \n  * `read_time` - The number of seconds before the plugin will expand. Default is 30 seconds. Minimum is 10 seconds.  \n  * `action` - The verb to display on the button. Options: 'like', 'recommend' \n  * `side` - the side of the screen where the plugin will be displayed. This will automatically adjust based on the language, or can be set explicitly. Options: 'left', 'right' \n  * `site` - a comma separated list of domains to show recommendations for. The default is the domain of the `href` parameter. \n  * `ref` - a label for tracking referrals; must be less than 50 characters and can contain alphanumeric characters and some punctuation (currently +/=-.:_). The ref attribute causes two parameters to be added to the referrer URL when a user clicks a link from a stream story about a Like action: \n   * `fb_ref` - the ref parameter \n    * `fb_source` - the stream type ('home', 'profile', 'search', 'other') in which the click occurred and the story type ('oneline' or 'multiline'), concatenated with an underscore. \n  * `num_recommendations` - the number of recommendations to display. By default, this value is 2 and the maximum value is 5. \n  *  `max_age` - a limit on recommendation and creation time of articles that are surfaced in the plugins, the default is 0 (we don’t take age into account). Otherwise the valid values are 1-180, which specifies the number of days. \n\n <b>Usage Notes</b>: If you implement the Recommendations Bar, you may only publish Open Graph read actions through the Recommendations Bar.", 
            "name": "Recommendations Bar", 
            "params": {
                "action": {
                    "default": "like", 
                    "description": "The verb to display in the plugin. Currently only 'like' and 'recommend' are supported.", 
                    "label": "Verb to display", 
                    "priority": 5, 
                    "type": "enum", 
                    "values": [
                        "like", 
                        "recommend"
                    ]
                }, 
                "href": {
                    "description": "The URL of the article. Defaults to the current page.", 
                    "example": "https://developers.facebook.com/blog/post/559/", 
                    "label": "URL of the article", 
                    "priority": 1, 
                    "type": "string"
                }, 
                "read_time": {
                    "default": "30", 
                    "description": "The number of seconds the plugin will wait before it expands.", 
                    "label": "Read Time", 
                    "priority": 3, 
                    "type": "int"
                }, 
                "side": {
                    "default": "right", 
                    "description": "The side of the window where the plugin will display.", 
                    "label": "Side", 
                    "priority": 7, 
                    "type": "enum", 
                    "values": [
                        "left", 
                        "right"
                    ]
                }, 
                "site": {
                    "description": "The domain for which to show recommendations. Defaults to the domain the plugin is on.", 
                    "label": "Domain", 
                    "priority": 8, 
                    "type": "string"
                }, 
                "trigger": {
                    "default": "onvisible", 
                    "description": "When to expand the plugin", 
                    "label": "Trigger", 
                    "priority": 2, 
                    "type": "enum", 
                    "values": [
                        "onvisible", 
                        "X%", 
                        "manual"
                    ]
                }
            }, 
            "requires_appid": true, 
            "url": "https://developers.facebook.com/docs/reference/plugins/recommendationsbar/", 
            "xfbml": "fb:recommendations-bar"
        }
    ]
}
